from pythainlp import sent_tokenize

##text = ("คดีสืบเนื่องมาจากศาลชั้นต้นพิพากษาว่า \
##จำเลยมีความผิดตามประมวลกฎหมายอาญา มาตรา 326, 328 พระราชบัญญัติว่าด้วยการกระทำความผิดเกี่ยวกับคอมพิวเตอร์ พ.ศ.2550 \
##มาตรา 14 (4) การกระทำของจำเลยเป็นความผิดหลายกรรม \
##ให้ลงโทษทุกกรรมเป็นกระทงความผิดไปตามประมวลกฎหมายอาญา \
##มาตรา 91 วางโทษฐานหมิ่นประมาทโดยการโฆษณา จำคุก 2 เดือน และปรับ 20,000 \
##บาท ฐานนำเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลคอมพิวเตอร์ใด ๆ ที่มีลักษณะอันลามก \
##จำคุก 2 เดือน และปรับ 20,000 บาท รวมจำคุก 4 \
##เดือน และปรับ 40,000 บาท")

text = str(input("input :"))

print("default (crfcut):")
print(sent_tokenize(text))
print("\nwhitespace+newline:")
print(sent_tokenize(text, engine="whitespace+newline"))