from pythainlp.corpus.common import thai_words
from pythainlp.util import Trie
from pythainlp import word_tokenize

import json
from .dict import *
from .stopword import read_stopword


def extract(text, date, party):

    dict = set(read_dict())
    dict = dict.union(set(read_stopword()))

    dict = dict.union(date)
    dict = dict.union(party)

    words = dict.union(thai_words())

    custom_dictionary_trie = Trie(words)
    #print("custom dictionary :", word_tokenize(text, custom_dict=custom_dictionary_trie, keep_whitespace=False))
    result = word_tokenize(text, custom_dict=custom_dictionary_trie, keep_whitespace=False)
    result = [x for x in result if x != '\n']
    #print(result)
    return result

#extract("ทดสอบ")

def stopword(text):
    pass



# a = regex_date("""
# ป.พ.พ. มาตรา 686 ที่แก้ไขใหม่ มีผลใช้บังคับแล้ว เจ้าหนี้ผู้เป็นโจทก์จึงต้องปฏิบัติตามบทบัญญัติดังกล่าว โดยต้องมีหนังสือบอกกล่าวไปยังผู้ค้ำประกันภายใน 60 วัน 
# นับแต่วันที่ลูกหนี้ผิดนัด การที่โจทก์เพิ่งมีหนังสือแจ้งสิทธิการซื้อทรัพย์สินลงวันที่ 26 กุมภาพันธ์ 2559 
# ส่งไปยังจำเลยที่ 2 ตามที่อยู่ที่ปรากฏตามสัญญาค้ำประกันโดยหนังสือดังกล่าวถูกส่งคืนกลับต้นทาง และโจทก์ขายทอดตลาดรถยนต์ที่เช่าซื้อเมื่อวันที่ 21 เมษายน 2559 หลังจากนั้นโจทก์มีหนังสือบอกกล่าวทวงถามไปยังจำเลยที่ 2 อีกครั้ง เมื่อวันที่ 9 มิถุนายน 2559 โดยจำเลยที่ 2 ได้รับเมื่อวันที่ 15 มิถุนายน 2559 จำเลยที่ 2 ในฐานะผู้ค้ำประกันย่อมหลุดพ้นจากความรับผิดในดอกเบี้ยและค่าสินไหมทดแทน ตลอดจนค่าภาระติดพัน
# อันเป็นอุปกรณ์แห่งหนี้รายนั้นบรรดาที่เกิดขึ้นภายหลังจากพ้นกำหนดเวลา 60 วัน 
# """)

# #print(extract("""
# ป.พ.พ. มาตรา 686 ที่แก้ไขใหม่ มีผลใช้บังคับแล้ว เจ้าหนี้ผู้เป็นโจทก์จึงต้องปฏิบัติตามบทบัญญัติดังกล่าว โดยต้องมีหนังสือบอกกล่าวไปยังผู้ค้ำประกันภายใน 60 วัน 
# นับแต่วันที่ลูกหนี้ผิดนัด การที่โจทก์เพิ่งมีหนังสือแจ้งสิทธิการซื้อทรัพย์สินลงวันที่ 26 กุมภาพันธ์ 2559 
# ส่งไปยังจำเลยที่ 2 ตามที่อยู่ที่ปรากฏตามสัญญาค้ำประกันโดยหนังสือดังกล่าวถูกส่งคืนกลับต้นทาง และโจทก์ขายทอดตลาดรถยนต์ที่เช่าซื้อเมื่อวันที่ 21 เมษายน 2559 หลังจากนั้นโจทก์มีหนังสือบอกกล่าวทวงถามไปยังจำเลยที่ 2 อีกครั้ง เมื่อวันที่ 9 มิถุนายน 2559 โดยจำเลยที่ 2 ได้รับเมื่อวันที่ 15 มิถุนายน 2559 จำเลยที่ 2 ในฐานะผู้ค้ำประกันย่อมหลุดพ้นจากความรับผิดในดอกเบี้ยและค่าสินไหมทดแทน ตลอดจนค่าภาระติดพัน
# อันเป็นอุปกรณ์แห่งหนี้รายนั้นบรรดาที่เกิดขึ้นภายหลังจากพ้นกำหนดเวลา 60 วัน 
# """,a))